Repository: GabrielBris/DesignPatterns
Catalog: DesignPatterns/Sources/Localizable.xcstrings
Source language: en
Languages: es_419

# about.attribution.message
source: This project is educational material based on: “Dive Into Design Patterns" by Alexander Shvets This content is for personal learning only and has no commercial purpose. All rights of the original content belong to the author. [View book](https://refactoring.guru/design-patterns)
es_419: Este proyecto es material educativo basado en: "Sumérgete en los Patrones de Diseño" por Alexander Shvets Este contenido es solo para aprendizaje personal y no tiene fines comerciales. Todos los derechos del contenido original pertenecen al autor. [Ver libro](https://refactoring.guru/es/design-patterns)

# designpatterns.behavioral_design_patterns.title
source: Behavioral design patterns
es_419: Patrones de comportamiento

# designpatterns.creational_design_patterns.title
source: Creational design patterns
es_419: Patrones creacionales

# designpatterns.structural_design_patterns.title
source: Structural design patterns
es_419: Patrones estructurales

# designpatterns.title
source: The design patterns catalog
es_419: El catálogo de patrones de diseño

# pattern.abstract_factory.title
source: Abstract factory
es_419: Fábrica abstracta

# pattern.builder.title
source: Builder
es_419: Constructor

# pattern.factory_method.title
source: Factory method
es_419: Método fábrica

# pattern.prototype.title
source: Prototype
es_419: Prototipo

# pattern.singleton.title
source: Singleton
es_419: Instancia única

# patterncatalog.cell.trymebutton
source: Try me!
es_419: Pruébame!

# patterncatalog.title
source: Catalog
es_419: Explorar

# pillars.abstraction.description
source: "Abstraction is the model of a real-world object or phenomenon, limited to a specific context, that represents all the data relevant to this context with great precision, omitting the rest."
es_419: “La Ab­s­t­ra­c­ción es el mo­de­lo de un ob­je­to o fe­nó­meno del mundo real, li­mi­ta­do a un co­n­te­x­to es­pe­cí­fi­co, que re­p­re­se­n­ta todos los datos re­le­va­n­tes a este co­n­te­x­to con gran pre­ci­sión, omi­tie­n­do el resto.”

# pillars.abstraction.title
source: Abstraction
es_419: Abstracción

# pillars.encapsulation.description
source: "Encapsulation is the ability that an object has to hide parts of its state and behavior from other objects, exposing only a limited interface to the rest of the program."
es_419: “La en­ca­p­su­la­ción es la ca­pa­ci­dad que tiene un ob­je­to de es­co­n­der pa­r­tes de su es­ta­do y co­m­po­r­ta­mie­n­to de otros ob­je­tos, ex­po­nie­n­do úni­ca­me­n­te una in­te­r­faz li­mi­ta­da al resto del programa.”

# pillars.encapsulation.title
source: Encapsulation
es_419: Encapsulación

# pillars.inheritance.description
source: "If you want to create a class slightly different from an existing one, there is no need to duplicate the code. Instead, you extend the existing class and place the additional functionality within a resulting subclass that inherits the fields and methods of the superclass."
es_419: “Si quie­res crear una clase li­ge­ra­me­n­te di­fe­re­n­te a una ya exi­s­te­n­te, no hay ne­ce­si­dad de du­p­li­car el có­di­go. En su lugar, ex­tie­n­des la clase exi­s­te­n­te y co­lo­cas la fu­n­cio­na­li­dad adi­cio­nal de­n­t­ro de una su­b­c­la­se re­su­l­ta­n­te que he­re­da los ca­m­pos y mé­to­dos de la superclase.”

# pillars.inheritance.title
source: Inheritance
es_419: Herencia

# pillars.polymorphism.description
source: "Polymorphism is the ability that a program has to detect the true class of an object and invoke its implementation, even though its real type is unknown in the current context."
es_419: “El po­li­mo­r­fi­s­mo es la ca­pa­ci­dad que tiene un pro­g­ra­ma de de­te­c­tar la ve­r­da­de­ra clase de un ob­je­to e in­vo­car su im­p­le­me­n­ta­ción, in­c­lu­so au­n­que su tipo real sea de­s­co­no­ci­do en el co­n­te­x­to actual.”

# pillars.polymorphism.title
source: Polymorphism
es_419: Polimorfismo

# pillars.title
source: The pillars of the OOP
es_419: Los pilares de la POO

# relationamongobjects.aggregation.description
source: "Normally, with aggregation, an object 'has' a group of other objects and serves as a container or collection. The component can exist without the container and can be linked to several containers at the same time."
es_419: “No­r­ma­l­me­n­te, con la ag­re­ga­ción, un ob­je­to “tiene” un grupo de otros ob­je­tos y sirve como co­n­te­ne­dor o co­le­c­ción. El co­m­po­ne­n­te puede exi­s­tir sin el co­n­te­ne­dor y puede vi­n­cu­lar­se a va­rios co­n­te­ne­do­res al mismo tie­m­po. ”

# relationamongobjects.aggregation.title
source: Aggregation
es_419: Agregación

# relationamongobjects.association.description
source: "Association can be seen as a specialized type of dependency, in which an object always has access to the objects with which it interacts, while simple dependency does not establish a permanent link between objects."
es_419: “La aso­cia­ción puede verse como un tipo es­pe­cia­li­za­do de de­pe­n­de­n­cia, en la que un ob­je­to sie­m­p­re tiene ac­ce­so a los ob­je­tos con los que in­ter­ac­túa, mie­n­t­ras que la de­pe­n­de­n­cia si­m­p­le no es­ta­b­le­ce un ví­ncu­lo pe­r­ma­ne­n­te entre los objetos.”

# relationamongobjects.association.title
source: Association
es_419: Asociación

# relationamongobjects.composition.description
source: "Composition is a specific type of aggregation in which an object is composed of one or more instances of the other. The difference between this and other relationships is that the component can only exist as part of the container."
es_419: “La co­m­po­si­ción es un tipo es­pe­cí­fi­co de ag­re­ga­ción en la que un ob­je­to se co­m­po­ne de una o más in­s­ta­n­cias del otro. La di­fe­re­n­cia entre ésta y otras re­la­cio­nes está en que el co­m­po­ne­n­te sólo puede exi­s­tir como parte del co­n­te­ne­dor. ”

# relationamongobjects.composition.title
source: Composition
es_419: Composición

# relationamongobjects.dependence.description
source: "You can make a dependency weaker by making your code depend on interfaces or abstract classes instead of concrete classes."
es_419: “Pue­des hacer más débil una de­pe­n­de­n­cia ha­cie­n­do que tu có­di­go de­pe­n­da de in­te­r­fa­ces o cla­ses ab­s­t­ra­c­tas en lugar de cla­ses concretas.”

# relationamongobjects.dependence.title
source: Dependency
es_419: Dependencia

# relationamongobjects.title
source: Relation among objects
es_419: Relación entre objetos

# solidprinciples.dependency_inversion.description
source: “High-level modules should not depend on low-level modules. Both should depend on abstractions. Abstractions should not depend on details. Details should depend on abstractions.” — Your core business logic (high level) should not *know about* or be tightly coupled to concrete implementation details (low level). Instead, both should communicate through **contracts** (abstractions), which in Swift are typically **protocols**.
es_419: “Las cla­ses de alto nivel no deben de­pe­n­der de cla­ses de bajo nivel. Ambas deben de­pe­n­der de ab­s­t­ra­c­cio­nes. Las ab­s­t­ra­c­cio­nes no deben de­pe­n­der de de­ta­l­les. Los de­ta­l­les deben de­pe­n­der de ab­s­t­ra­c­cio­nes.” — Tu lógica importante (alto nivel) no debería “conocer” detalles concretos (bajo nivel). En lugar de eso, ambos deberían hablar mediante contratos (abstracciones), en Swift protocolos.

# solidprinciples.dependency_inversion.title
source: Dependency Inversion Principle
es_419: Principio de inversión de la dependencia

# solidprinciples.interface_segregation.description
source: “Clients should not be forced to depend on methods they do not use. According to the **Interface Segregation Principle (ISP)**, you should break down *fat* or *bloated* interfaces into smaller, more granular, and more specific ones. Clients should implement only the methods they actually need. Otherwise, a change to a *fat* interface can cause ripple effects and break even those clients that do not use the modified methods.”
es_419: “No se debe fo­r­zar a los clie­n­tes a de­pe­n­der de mé­to­dos que no utilizan. Según el pri­n­ci­pio de se­g­re­ga­ción de la in­te­r­faz, debes de­si­n­te­g­rar las in­te­r­fa­ces “grue­sas” hasta crear otras más de­ta­l­la­das y es­pe­cí­fi­cas. Los clie­n­tes deben im­p­le­me­n­tar úni­ca­me­n­te aque­l­los mé­to­dos que ne­ce­si­tan de ve­r­dad. De lo co­n­t­ra­rio, un ca­m­bio en una in­te­r­faz “grue­sa” de­s­co­m­po­n­d­rá in­c­lu­so clie­n­tes que no uti­li­zan los mé­to­dos cambiados.”

# solidprinciples.interface_segregation.title
source: Interface Segregation Principle
es_419: Principio de Segregación de la interfaz

# solidprinciples.liskov_substitution.description
source: “When extending a class, remember that you should be able to pass objects of the subclasses in place of objects of the parent class, without breaking the client code.” - Basically: If `B` is a subtype of `A`, then you should be able to use an object of `B` anywhere an object of `A` is expected, without breaking the program. In other words: a child class should be able to “substitute” the parent class without surprises.
es_419: “Al ex­te­n­der una clase, re­cue­r­da que debes tener la ca­pa­ci­dad de pasar ob­je­tos de las su­b­c­la­ses en lugar de ob­je­tos de la clase padre, sin de­s­co­m­po­ner el có­di­go cliente.” — Basicamente Si B es un subtipo de A, entonces deberías poder usar un objeto de B en cualquier lugar donde se espera A, sin romper el programa. O sea: una clase hija debe poder “sustituir” a la clase padre sin sorpresas.

# solidprinciples.liskov_substitution.title
source: Liskov Substitution Principle
es_419: Principio de sustitución de Liskov

# solidprinciples.open_closed.description
source: "Classes should be open for extension but closed for modification."
es_419: “Las cla­ses deben estar abie­r­tas a la ex­te­n­sión pero ce­r­ra­das a la modificación.”

# solidprinciples.open_closed.title
source: Open/Closed Principle
es_419: Principio de Abierto/Cerrado

# solidprinciples.single_responsibility.description
source: "Try to make each class responsible for a single part of the functionality provided by the software, and make that responsibility completely encapsulated by (you can also say hidden within) the class."
es_419: “In­te­n­ta hacer a cada clase re­s­po­n­sa­b­le de una única parte de la fu­n­cio­na­li­dad pro­po­r­cio­na­da por el so­f­t­wa­re, y haz que esa re­s­po­n­sa­bi­li­dad quede to­ta­l­me­n­te en­ca­p­su­la­da por (ta­m­bién pue­des decir es­co­n­di­da de­n­t­ro de) la clase.“

# solidprinciples.single_responsibility.title
source: Single Re­s­po­n­si­bi­li­ty Pri­n­ci­p­le
es_419: Pri­n­ci­pio de re­s­po­n­sa­bi­li­dad única

# solidprinciples.title
source: SOLID Principles
es_419: Principios SOLID
